Autodesk.Revit.DB.Architecture.StairsPath.CanCreateOnMultistoryStairs(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.LinkElementId)
Checks if more stairs paths can be added on the plan views of a multistory stairs.
multistoryStairsId:
The multistory stairs id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPath.CreateOnMultistoryStairs(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.ElementId)
Creates a new stairs path for the stairs in a multistory stairs with the specified stairs path type only in the plan view.
document:
The document.
multistoryStairsId:
The id of the multistory stairs element either in the host document or in a linked document.
typeId:
The type of stairs path.
Returns:
The new stairs paths.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Cannot add more stairs paths on multistoryStairsId.
-or-
The typeId is not a valid stairs path type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Architecture.StairsPath.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new stairs path for the specified stairs with the specified stairs path type only in the plan view.
document:
The document.
stairsId:
The id of the stairs element either in the host document or in a linked document.
typeId:
The type of stairs path.
planViewId:
The plan view in which the stairs path will be shown.
Returns:
The new stairs path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The stairsId is not a valid stairs.
-or-
The typeId is not a valid stairs path type.
-or-
The planViewId is not a valid plan view.
-or-
The stairsId already has a stairs path.
-or-
The stairsId is not visible in planViewId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPath.ShowDownText
Represents whether show stairs down text or not.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The type of this stairs path is not automatic up/down direction.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPath.ShowUpText
Represents whether show stairs up text or not.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPath.TextOrientation
The orientation of stair up and down text.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPath.StairsId
The host stairs element id.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPath.StairsPathOffset
The offset of stairs path to center line of stairs.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for stairsPathOffset is not finite
-or-
When setting this property: The stairsPathOffset is larger than half the width of the stairs.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPath.DownTextOffset
The offset of stairs down text.
Remarks:
The z direction makes no sense in API.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The type of this stairs path is not automatic up/down direction.
-or-
When setting this property: The stairs path doesn't show down text so the data being set is inapplicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPath.UpTextOffset
The offset of stairs up text.
Remarks:
The z direction makes no sense in API.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs path doesn't not show up text so the data being set is inapplicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPath.DownText
The stairs down text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The type of this stairs path is not automatic up/down direction.
-or-
When setting this property: The stairs path doesn't show down text so the data being set is inapplicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPath.UpText
The stairs up text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs path doesn't not show up text so the data being set is inapplicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPath
An object that represents the stairs path.
Since:
2013